In [44]:
import pandas as pd

#import data
data = pd.read_csv('../data/all_stocks_5yr.csv')

#View
data.head()

         date   open   high    low  close    volume Name
0  2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

## Data Preprocessing

In [45]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 619040 entries, 0 to 619039
Data columns (total 7 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    619040 non-null  object
 1   open    619029 non-null  float64
 2   high    619032 non-null  float64
 3   low     619032 non-null  float64
 4   close   619040 non-null  float64
 5   volume  619040 non-null  int64
 6   Name    619040 non-null  object
dtypes: float64(4), int64(1), object(2)
memory usage: 33.1+ MB

In [46]:
data.columns = data.columns.str.lower()

In [47]:
data['date'] = pd.to_datetime(data['date'])

###### Investment Portfolios

In [48]:
# Creating investment portfolios

# List of low risk portfolio comprising stable, dividend-paying companies with consistent performance.
low_risk_stocks = [
    "PG",
    "JNJ",
    "PEP",
    "WMT",
    "V",
    "MCD",
    "KO",
    "MMM",
    "MSFT",
    "COST"
]

# Filtering data for rows corresponding to low risk stocks
low_risk_port = data[data['name'].isin(low_risk_stocks)]

# Viewing the low risk portfolio
low_risk_port.head()

             date    open    high      low   close   volume  name
139481 2013-02-08  102.38  102.96  101.810  102.79  1726289  COST
139482 2013-02-11  102.87  102.94  101.760  101.99  1457384  COST
139483 2013-02-12  102.21  102.23  101.530  101.76  1203174  COST
139484 2013-02-13  101.98  102.37  100.950  101.63  1224373  COST
139485 2013-02-14  101.04  102.06  101.012  102.02  2211142  COST

In [49]:
#Checking the name colum
low_risk_port.value_counts('name')

name
COST    1259
JNJ     1259
KO      1259
MCD     1259
MMM     1259
MSFT    1259
PEP     1259
PG      1259
V       1259
WMT     1259
Name: count, dtype: int64

In [50]:
#Checking for Null values
low_risk_port.isnull().any()

date      False
open      False
high      False
low       False
close     False
volume    False
name      False
dtype: bool

In [51]:
# List of moderate risk portfolio includes a mix of stable blue-chip companies along with some growth-oriented stocks.
mod_risk_stocks = [
    "AAPL",
    "JNJ",
    "KO",
    "GOOGL",
    "V",
    "JPM",
    "CSCO",
    "INTC",
    "HD",
    "AXP"
]

# Filtering data for rows corresponding to moderate risk stocks
mod_risk_port = data[data['name'].isin(mod_risk_stocks)]

# Viewing the moderate risk portfolio
mod_risk_port.head()

           date     open     high      low    close     volume  name
1259 2013-02-08  67.7142  68.4014  66.8928  67.8542  158168416  AAPL
1260 2013-02-11  68.0714  69.2771  67.6071  68.5614  129029425  AAPL
1261 2013-02-12  68.5014  68.9114  66.8205  66.8428  151829363  AAPL
1262 2013-02-13  66.7442  67.6628  66.1742  66.7156  118721995  AAPL
1263 2013-02-14  66.3599  67.3771  66.2885  66.6556   88809154  AAPL

In [52]:
#Checking the name colum
mod_risk_port.value_counts('name')

name
AAPL     1259
AXP      1259
CSCO     1259
GOOGL    1259
HD       1259
INTC     1259
JNJ      1259
JPM      1259
KO       1259
V        1259
Name: count, dtype: int64

In [53]:
mod_risk_port.isnull().any()

date      False
open      False
high      False
low       False
close     False
volume    False
name      False
dtype: bool

In [54]:
# List of hight risk  portfolio consists of more volatile stocks with higher growth potential but also higher risk.
high_risk_stocks = [
    "RCL",  # Royal Caribbean Group
    "CCL",  # Carnival Corporation
    "UAL",  # United Airlines Holdings, Inc.
    "DAL",  # Delta Air Lines, Inc.
    "APA",  # Apache Corporation
    "GPS",  # Gap Inc.
    "KSS",  # Kohl's Corporation
    "MAC",  # Macerich Company
    "URBN",  # Urban Outfitters, Inc.
    "LB"    # L Brands, Inc.
]

#Filtering  data for rows corresponding to high risk stocks
high_risk_port = data[data['name'].isin(high_risk_stocks)]

#Viewing the high risk portfolio
high_risk_port

             date   open     high      low  close   volume name
53941  2013-02-08  84.13  85.1800  84.1100  84.65  2181859  APA
53942  2013-02-11  84.81  85.4700  83.7300  83.81  2207403  APA
53943  2013-02-12  84.06  84.4300  83.3300  84.18  2735842  APA
53944  2013-02-13  84.18  84.4300  83.7000  84.33  3168636  APA
53945  2013-02-14  83.72  84.0000  80.1100  80.33  8653948  APA
...           ...    ...      ...      ...    ...      ...  ...
558208 2018-02-01  67.22  67.9500  66.2300  67.15  5603314  UAL
558209 2018-02-02  66.63  66.8900  65.4800  65.68  4189758  UAL
558210 2018-02-05  65.00  65.4400  63.2811  63.40  5433829  UAL
558211 2018-02-06  62.16  64.2200  61.9600  63.95  4670812  UAL
558212 2018-02-07  63.84  66.5783  63.7500  65.36  5694871  UAL

[11331 rows x 7 columns]

In [55]:
#Checking the name colum
high_risk_port.value_counts('name')

name
APA    1259
CCL    1259
DAL    1259
GPS    1259
KSS    1259
LB     1259
MAC    1259
RCL    1259
UAL    1259
Name: count, dtype: int64

In [56]:
high_risk_port.isnull().any()

date      False
open      False
high      False
low       False
close     False
volume    False
name      False
dtype: bool

Three portfolio with different risk levels were created, from the stock data, were none of them contain missing values.

In [57]:
# Exporting Porfolio Data
low_risk_port.to_csv('../data/low_risk_port.csv', index = False)
mod_risk_port.to_csv('../data/mod_risk_port.csv', index = False)
high_risk_port.to_csv('../data/high_risk_port.csv', index = False)